-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2020-06-14 10:28:13
-- 服务器版本： 5.7.26
-- PHP 版本： 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `sanguo`
--

-- --------------------------------------------------------

--
-- 表的结构 `caocao`
--

CREATE TABLE `caocao` (
  `id` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `time` varchar(255) DEFAULT NULL,
  `place` varchar(255) DEFAULT NULL,
  `x` varchar(255) DEFAULT NULL,
  `y` varchar(255) DEFAULT NULL,
  `events` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `caocao`
--

INSERT INTO `caocao` (`id`, `name`, `time`, `place`, `x`, `y`, `events`) VALUES
('1', '曹操', '155', '沛国谯县', '113.1016187', '23.07307856', '出生'),
('2', '曹操', '174', '洛阳', '112.4594213', '34.62426278', '举为孝廉，入京都洛阳为郎。不久，被任命为洛阳北部尉'),
('3', '曹操', '178', '沛国谯县', '113.1016187', '23.07307856', '因堂妹夫濦强侯宋奇被宦官诛杀，受到牵连，被免去官职。其后，在洛阳无事可做，回到家乡谯县闲居'),
('4', '曹操', '186', '洛阳', '112.4594213', '34.62426278', '被朝廷征召，任命为议郎'),
('5', '曹操', '184', '颍川', '118.1543607', '24.71719493', '黄巾起义爆发，曹操被拜为骑都尉，受命与皇甫嵩等人合军进攻颍川的黄巾军'),
('6', '曹操', '185', '济南', '117.1263994', '36.6565542', '破黄巾军，斩首数万级。随之迁为济南相'),
('7', '曹操', '188', '洛阳', '112.4594213', '34.62426278', '汉灵帝为巩固统治，设置西园八校尉，曹操因其家世被任命为八校尉中的典军校尉'),
('8', '曹操', '189', '陈留', '114.5408421', '34.68295048', '曹操见董卓倒行逆施，不愿与其合作，遂改易姓名逃出京师洛阳（今洛阳东）'),
('9', '曹操', '190', '荥阳汴水', '113.3894228', '34.7938105', '与董卓大将徐荣交锋，因为士兵数量悬殊，曹操大败，士卒死伤大半，自己也被流矢所伤，幸得堂弟曹洪所救，幸免于难'),
('10', '曹操', '191', '东郡', '106.502088', '29.50886598', '大败于毒、白绕、眭固、於扶罗等，袁绍表其为东郡太守。'),
('11', '曹操', '192', '兖州', '116.7901152', '35.55795237', '青州黄巾军大获发展，连破兖州（治昌邑，今山东巨野东南）郡县，阵斩兖州刺史刘岱。济北相鲍信等人迎曹操出任兖州牧。'),
('12', '曹操', '193', '徐州', '117.2905754', '34.21266655', '徐州牧陶谦率军攻入兖州南部的任城，曹操率军征讨陶谦，攻克徐州十余城。'),
('13', '曹操', '194', '东海', '118.7595651', '34.54791863', '曹操再征徐州，略地至东海'),
('14', '曹操', '195', '兖州', '116.7901152', '35.55795237', '曹操整军再战吕布，三败之，破定陶（今山东定陶）、廪丘（今山东郓城西北）等，平定兖州。'),
('15', '曹操', '196', '许县', '113.8584755', '34.04143161', '曹操迎汉献帝。辛亥，汉献帝封曹操为司隶校尉，录尚书事。庚申，迁都许县。'),
('16', '曹操', '197', '淯水', '112.42914', '33.48979', '曹操讨伐张绣，军队驻扎在淯水，张绣举众投降，旋即复叛，长子曹昂、侄子曹安民、猛将典韦战死。'),
('17', '曹操', '198', '徐州', '117.2905754', '34.21266655', '曹操东征徐州，进攻久与他为敌的吕布。在曹军攻势之下，吕布军上下离心，十二月，吕布部将魏续、宋宪等生擒陈宫归降曹操。吕布见大势已去，下城投降。'),
('18', '曹操', '199', '官渡', '113.97624', '34.71903', '曹操自率军屯于官渡（今中牟北），准备迎击袁绍。'),
('19', '曹操', '200', '白马', '114.5255532', '35.5810454', '曹操亲自率兵北上解白马之围'),
('20', '曹操', '200', '官渡', '113.97624', '34.71903', '袁绍大军连营而进，东西数十里，依沙堆为屯，进逼官渡。曹操分兵坚守营垒，伺机而动'),
('21', '曹操', '200', '乌巢', '116.3299936', '39.8317681', '曹操军至乌巢，命四面放火，袁军大乱，淳于琼拒营死守。大破袁军，斩淳于琼等，尽燔其粮草。'),
('22', '曹操', '204', '邺城', '114.6264269', '36.34076598', '曹操乘袁尚出兵攻打袁谭之机，进军围攻邺城（今河北邯郸临漳西一带）'),
('23', '曹操', '205', '冀州', '115.5854299', '37.55708603', '曹操又以负约为名，攻灭袁谭，冀、青二州平定'),
('24', '曹操', '206', '并州', '112.5137396', '37.86924926', '曹操攻灭高干，平定并州'),
('25', '曹操', '207', '乌桓', '116.3486252', '39.73255524', '曹操为了肃清袁氏残余势力，也为了彻底解决三郡乌桓入塞为害问题，决定远征乌桓'),
('26', '曹操', '208', '荆州', '112.2455226', '30.34084211', '进军南征荆州刘表'),
('27', '曹操', '208', '当阳长坂', '117.2646414', '24.7936993', '怕江陵落入刘备之手，遂亲率五千骑兵从襄阳（今湖北襄樊）疾驰三百里，在当阳长坂（今湖北当阳东北）将刘备追上，大破其军，随后进占江陵'),
('28', '曹操', '208', '赤壁', '113.9064369', '29.730666', '曹操自江陵东下，至赤壁（今湖北武昌县西赤矶山）与孙、刘联军接战'),
('29', '曹操', '211', '关中', '114.5335496', '30.72180772', '曹操率大军亲征关中，大败关中联军'),
('30', '曹操', '213', '濡须口', '118.107462', '31.74086221', '起兵号称四十万，亲自南征孙权'),
('31', '曹操', '215', '汉中', '107.0294302', '33.07379991', '率十万大军亲征汉中张鲁'),
('32', '曹操', '217', '濡须口', '118.107462', '31.74086221', '曹操再次南征，率军猛攻濡须口，击败孙权'),
('33', '曹操', '218', '长安', '114.5456116', '38.04325614', '曹操亲率大军赶往关中，坐镇长安，以便随时指挥汉中战局'),
('34', '曹操', '219', '洛阳', '112.4594213', '34.62426278', '曹操从关中赶到洛阳，亲自指挥救援樊城'),
('35', '曹操', '220', '邺城西郊高陵', '114.6264269', '36.34076598', '曹操还军洛阳。当月，病逝在洛阳，终年六十六岁，谥曰武王，于二月廿一丁卯日（4月11日）被安葬于邺城西郊的高陵。');

-- --------------------------------------------------------

--
-- 表的结构 `guanyu`
--

CREATE TABLE `guanyu` (
  `id` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `time` varchar(255) DEFAULT NULL,
  `place` varchar(255) DEFAULT NULL,
  `x` varchar(255) DEFAULT NULL,
  `y` varchar(255) DEFAULT NULL,
  `events` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `guanyu`
--

INSERT INTO `guanyu` (`id`, `name`, `time`, `place`, `x`, `y`, `events`) VALUES
('1', '关羽', '160', '河东郡解县', '117.258413', '39.13448733', '出生'),
('2', '关羽', '184', '平原', '116.4405047', '37.17122146', '刘备担任平原相时，任命关羽、张飞为别部司马，分统部曲'),
('3', '关羽', '194', '徐州', '117.2905754', '34.21266655', '曹操因曹嵩被杀而迁怒于陶谦，于是发兵攻打徐州。陶谦求救于刘备，刘备和关羽率千余人前往救援，后刘备担任徐州牧'),
('4', '关羽', '198', '许昌', '113.8584755', '34.04143161', '刘备与曹操共擒吕布于下邳，夺得徐州。曹操任车胄为徐州刺史。刘备、关羽、张飞等人便跟随曹操班师回许昌'),
('5', '关羽', '200', '白马', '114.5255532', '35.5810454', '袁绍派大将颜良、淳于琼、郭图等攻东郡太守刘延于白马，关羽望见颜良的麾盖，策马冲锋，刺死颜良于万军之中，又拔出佩刀斩得颜良的首级，然后返还'),
('6', '关羽', '208', '夏口', '116.9283744', '34.45038899', '曹操率领大军南下，刘备南逃，另遣关羽乘数百艘船驶向江陵（今湖北荆州）会合，但刘备于途中当阳（今湖北宜昌）长坂坡被曹操军追至，幸而关羽驶至汉津（今湖北荆门），一同乘船至夏口（今湖北武汉）'),
('7', '关羽', '211', '荆州', '112.2455226', '30.34084211', '刘备入蜀助刘璋防御张鲁，张飞、赵云、诸葛亮与关羽共守荆州'),
('8', '关羽', '219', '樊城', '112.1425989', '32.05057237', '关羽留南郡太守糜芳守卫江陵，将军傅士仁驻守公安，自己率领大军攻打襄阳的吕常和樊城的曹仁'),
('9', '关羽', '219', '麦城', '110.3747117', '20.03300776', '关羽的将士都无心再战了，士卒渐渐溃散，退至麦城'),
('10', '关羽', '219', '临沮', '111.8453862', '31.78112971', '关羽率数十骑出逃，一路突围至距益州不过一二十里的临沮（今湖北省襄樊市南漳县），遇潘璋部将马忠的埋伏，被擒，和长子关平于临沮被害');

-- --------------------------------------------------------

--
-- 表的结构 `liubei`
--

CREATE TABLE `liubei` (
  `id` varchar(10) NOT NULL,
  `name` varchar(10) NOT NULL,
  `place` varchar(10) NOT NULL,
  `events` varchar(10) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `liubei`
--

INSERT INTO `liubei` (`id`, `name`, `place`, `events`) VALUES
('1', '刘备', '涿郡涿县', '出生'),
('2', '刘备', '安喜县', '刘备在镇压起义的战斗'),
('3', '刘备', '平原县', '刘备与青州刺史田楷一'),
('4', '刘备', '徐州', '曹操以为父报仇为名再'),
('5', '刘备', '小沛', '陶谦表刘备为豫州刺史'),
('6', '刘备', '徐州', '陶谦死后，麋竺率徐州'),
('7', '刘备', '豫州', '多次战败，前往许都投'),
('8', '刘备', '许都', '与曹操联合进攻吕布，'),
('9', '刘备', '小沛', '进军下邳，杀徐州刺史'),
('10', '刘备', '平原县', '衣带诏事发。曹操亲自'),
('11', '刘备', '汝南', '离开袁绍，以连结刘表'),
('12', '刘备', '新野', '曹操亲自讨伐刘备，刘'),
('13', '刘备', '隆中', '前往隆中拜访诸葛亮，'),
('14', '刘备', '江陵', '曹操大军突至，刘备退'),
('15', '刘备', '赤壁', '刘备联合孙权，与周瑜'),
('16', '刘备', '南郡', '刘备与周瑜在南郡共攻'),
('17', '刘备', '葭萌', '刘璋命令刘备攻击张鲁'),
('18', '刘备', '成都', '雒城被围近一年才被攻'),
('19', '刘备', '公安', '孙权派遣吕蒙袭取长沙'),
('20', '刘备', '汉中', '刘备率兵进攻汉中，派'),
('21', '刘备', '定军山', '刘备放弃阳平关，南渡'),
('22', '刘备', '秭归', '刘备以为关羽报仇的名'),
('23', '刘备', '夷陵', '刘备派遣黄权督江北水'),
('24', '刘备', '白帝城', '刘备托孤于诸葛亮，夏');

-- --------------------------------------------------------

--
-- 表的结构 `place`
--

CREATE TABLE `place` (
  `name` char(10) NOT NULL,
  `x` char(10) NOT NULL,
  `y` char(10) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `place`
--

INSERT INTO `place` (`name`, `x`, `y`) VALUES
('沛国谯县', '115.77914', '33.87641'),
('洛阳', '112.459421', '34.6242627'),
('颍川', '113.48794', '34.14048'),
('济南', '117.126399', '36.6565542'),
('陈留', '114.540842', '34.6829504'),
('荥阳汴水', '113.389422', '34.7938105'),
('东郡', '106.502088', '29.5088659'),
('兖州', '116.790115', '35.5579523'),
('东海', '118.759565', '34.5479186'),
('许县', '113.858475', '34.0414316'),
('淯水', '112.435425', '33.4961858'),
('官渡', '102.750481', '25.0211964'),
('官渡', '102.750481', '25.0211964'),
('乌巢', '116.329993', '39.8317681'),
('邺城', '114.626427', '36.3407659'),
('冀州', '115.585429', '37.5570860'),
('并州', '112.513739', '37.8692492'),
('乌桓', '116.348625', '39.7325552'),
('荆州', '112.245522', '30.3408421'),
('当阳长坂', '117.264641', '24.7936993'),
('赤壁', '113.906436', '29.730666'),
('关中', '114.533549', '30.7218077'),
('汉中', '107.029430', '33.0737999'),
('濡须口', '118.107462', '31.7408622'),
('长安', '114.545611', '38.0432561'),
('邺城西郊高陵', '114.626427', '36.3407659'),
('河东郡解县', '117.258413', '39.1344873'),
('平原', '116.440504', '37.1712214'),
('夏口', '116.928374', '34.4503889'),
('樊城', '112.142598', '32.0505723'),
('麦城', '111.78833', '30.82118'),
('临沮', '111.845386', '31.7811297'),
('涿郡涿县', '115.981619', '39.4910658'),
('安喜县', '114.996496', '38.5221988'),
('豫州', '113.759384', '34.7717129'),
('汝南', '114.369408', '33.0131408'),
('新野', '112.366549', '32.5266317'),
('隆中', '112.148071', '32.0644906'),
('赤壁', '113.906436', '29.730666'),
('葭萌', '105.722339', '32.3388369'),
('成都', '104.081533', '30.6558218'),
('汉中', '107.029430', '33.0737999'),
('定军山', '106.672638', '33.1196693'),
('夷陵', '111.332529', '30.7748333'),
('白帝城', '123.473661', '23.1599776');

-- --------------------------------------------------------

--
-- 表的结构 `sheet1`
--

CREATE TABLE `sheet1` (
  `id` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `time` varchar(255) DEFAULT NULL,
  `place` varchar(255) DEFAULT NULL,
  `x` varchar(255) DEFAULT NULL,
  `y` varchar(255) DEFAULT NULL,
  `events` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `sheet1`
--

INSERT INTO `sheet1` (`id`, `name`, `time`, `place`, `x`, `y`, `events`) VALUES
('1', '曹操', '155', '沛国谯县', '113.10161873', '23.073078561', '出生'),
('2', '曹操', '174', '洛阳', '112.4594213', '34.624262779', '举为孝廉，入京都洛阳为郎。不久，被任命为洛阳北部尉'),
('3', '曹操', '178', '沛国谯县', '113.10161873', '23.073078561', '因堂妹夫濦强侯宋奇被宦官诛杀，受到牵连，被免去官职。其后，在洛阳无事可做，回到家乡谯县闲居'),
('4', '曹操', '186', '洛阳', '112.4594213', '34.624262779', '被朝廷征召，任命为议郎'),
('5', '曹操', '184', '颍川', '118.15436066', '24.717194935', '黄巾起义爆发，曹操被拜为骑都尉，受命与皇甫嵩等人合军进攻颍川的黄巾军'),
('6', '曹操', '185', '济南', '117.12639941', '36.656554202', '破黄巾军，斩首数万级。随之迁为济南相'),
('7', '曹操', '188', '洛阳', '112.4594213', '34.624262779', '汉灵帝为巩固统治，设置西园八校尉，曹操因其家世被任命为八校尉中的典军校尉'),
('8', '曹操', '189', '陈留', '114.54084206', '34.682950476', '曹操见董卓倒行逆施，不愿与其合作，遂改易姓名逃出京师洛阳（今洛阳东）'),
('9', '曹操', '190', '荥阳汴水', '113.3894228', '34.7938105', '与董卓大将徐荣交锋，因为士兵数量悬殊，曹操大败，士卒死伤大半，自己也被流矢所伤，幸得堂弟曹洪所救，幸免于难'),
('10', '曹操', '191', '东郡', '106.50208803', '29.508865979', '大败于毒、白绕、眭固、於扶罗等，袁绍表其为东郡太守。'),
('11', '曹操', '192', '兖州', '116.79011515', '35.557952373', '青州黄巾军大获发展，连破兖州（治昌邑，今山东巨野东南）郡县，阵斩兖州刺史刘岱。济北相鲍信等人迎曹操出任兖州牧。'),
('12', '曹操', '193', '徐州', '117.29057543', '34.21266655', '徐州牧陶谦率军攻入兖州南部的任城，曹操率军征讨陶谦，攻克徐州十余城。'),
('13', '曹操', '194', '东海', '118.75956509', '34.547918627', '曹操再征徐州，略地至东海'),
('14', '曹操', '195', '兖州', '116.79011515', '35.557952373', '曹操整军再战吕布，三败之，破定陶（今山东定陶）、廪丘（今山东郓城西北）等，平定兖州。'),
('15', '曹操', '196', '许县', '113.85847554', '34.041431611', '曹操迎汉献帝。辛亥，汉献帝封曹操为司隶校尉，录尚书事。庚申，迁都许县。'),
('16', '曹操', '197', '淯水', '112.43542522', '33.496185804', '曹操讨伐张绣，军队驻扎在淯水，张绣举众投降，旋即复叛，长子曹昂、侄子曹安民、猛将典韦战死。'),
('17', '曹操', '198', '徐州', '117.29057543', '34.21266655', '曹操东征徐州，进攻久与他为敌的吕布。在曹军攻势之下，吕布军上下离心，十二月，吕布部将魏续、宋宪等生擒陈宫归降曹操。吕布见大势已去，下城投降。'),
('18', '曹操', '199', '官渡', '102.75048171', '25.021196424', '曹操自率军屯于官渡（今中牟北），准备迎击袁绍。'),
('19', '曹操', '200', '白马', '114.52555317', '35.581045401', '曹操亲自率兵北上解白马之围'),
('20', '曹操', '200', '官渡', '102.75048171', '25.021196424', '袁绍大军连营而进，东西数十里，依沙堆为屯，进逼官渡。曹操分兵坚守营垒，伺机而动'),
('21', '曹操', '200', '乌巢', '116.32999364', '39.831768098', '曹操军至乌巢，命四面放火，袁军大乱，淳于琼拒营死守。大破袁军，斩淳于琼等，尽燔其粮草。'),
('22', '曹操', '204', '邺城', '114.62642695', '36.340765981', '曹操乘袁尚出兵攻打袁谭之机，进军围攻邺城（今河北邯郸临漳西一带）'),
('23', '曹操', '205', '冀州', '115.58542988', '37.557086026', '曹操又以负约为名，攻灭袁谭，冀、青二州平定'),
('24', '曹操', '206', '并州', '112.51373959', '37.869249264', '曹操攻灭高干，平定并州'),
('25', '曹操', '207', '乌桓', '116.34862521', '39.732555236', '曹操为了肃清袁氏残余势力，也为了彻底解决三郡乌桓入塞为害问题，决定远征乌桓'),
('26', '曹操', '208', '荆州', '112.24552263', '30.340842108', '进军南征荆州刘表'),
('27', '曹操', '208', '当阳长坂', '117.26464143', '24.793699299', '怕江陵落入刘备之手，遂亲率五千骑兵从襄阳（今湖北襄樊）疾驰三百里，在当阳长坂（今湖北当阳东北）将刘备追上，大破其军，随后进占江陵'),
('28', '曹操', '208', '赤壁', '113.90643686', '29.730665998', '曹操自江陵东下，至赤壁（今湖北武昌县西赤矶山）与孙、刘联军接战'),
('29', '曹操', '211', '关中', '114.53354961', '30.721807717', '曹操率大军亲征关中，大败关中联军'),
('30', '曹操', '213', '濡须口', '118.10746204', '31.740862209', '起兵号称四十万，亲自南征孙权'),
('31', '曹操', '215', '汉中', '107.02943021', '33.073799908', '率十万大军亲征汉中张鲁'),
('32', '曹操', '217', '濡须口', '118.10746204', '31.740862209', '曹操再次南征，率军猛攻濡须口，击败孙权'),
('33', '曹操', '218', '长安', '114.54561161', '38.043256136', '曹操亲率大军赶往关中，坐镇长安，以便随时指挥汉中战局'),
('34', '曹操', '219', '洛阳', '112.4594213', '34.624262779', '曹操从关中赶到洛阳，亲自指挥救援樊城'),
('35', '曹操', '220', '邺城西郊高陵', '114.62642695', '36.340765981', '曹操还军洛阳。当月，病逝在洛阳，终年六十六岁，谥曰武王，于二月廿一丁卯日（4月11日）被安葬于邺城西郊的高陵。'),
('36', '关羽', '160', '河东郡解县', '117.25841295', '39.134487326', '出生'),
('37', '关羽', '184', '平原', '116.44050471', '37.171221463', '刘备担任平原相时，任命关羽、张飞为别部司马，分统部曲'),
('38', '关羽', '194', '徐州', '117.29057543', '34.21266655', '曹操因曹嵩被杀而迁怒于陶谦，于是发兵攻打徐州。陶谦求救于刘备，刘备和关羽率千余人前往救援，后刘备担任徐州牧'),
('39', '关羽', '198', '许昌', '113.85847554', '34.041431612', '刘备与曹操共擒吕布于下邳，夺得徐州。曹操任车胄为徐州刺史。刘备、关羽、张飞等人便跟随曹操班师回许昌'),
('40', '关羽', '200', '白马', '114.52555317', '35.581045401', '袁绍派大将颜良、淳于琼、郭图等攻东郡太守刘延于白马，关羽望见颜良的麾盖，策马冲锋，刺死颜良于万军之中，又拔出佩刀斩得颜良的首级，然后返还'),
('41', '关羽', '208', '夏口', '116.92837443', '34.450388987', '曹操率领大军南下，刘备南逃，另遣关羽乘数百艘船驶向江陵（今湖北荆州）会合，但刘备于途中当阳（今湖北宜昌）长坂坡被曹操军追至，幸而关羽驶至汉津（今湖北荆门），一同乘船至夏口（今湖北武汉）'),
('42', '关羽', '211', '荆州', '112.24552263', '30.340842108', '刘备入蜀助刘璋防御张鲁，张飞、赵云、诸葛亮与关羽共守荆州'),
('43', '关羽', '219', '樊城', '112.14259892', '32.050572375', '关羽留南郡太守糜芳守卫江陵，将军傅士仁驻守公安，自己率领大军攻打襄阳的吕常和樊城的曹仁'),
('44', '关羽', '219', '麦城', '110.37471165', '20.03300776', '关羽的将士都无心再战了，士卒渐渐溃散，退至麦城'),
('45', '关羽', '219', '临沮', '111.84538618', '31.781129707', '关羽率数十骑出逃，一路突围至距益州不过一二十里的临沮（今湖北省襄樊市南漳县），遇潘璋部将马忠的埋伏，被擒，和长子关平于临沮被害'),
('46', '郭嘉', '170', '颍川阳翟', '118.15436066', '24.717194935', '出生'),
('47', '郭嘉', '191', '冀州', '115.58542988', '37.557086026', '北行拜访袁绍'),
('48', '郭嘉', '191', '颍川', '118.15436066', '24.717194935', '离开了袁绍。就这样，郭嘉一直赋闲了六年'),
('49', '郭嘉', '196', '许县', '113.85847554', '34.041431611', '投奔并跟随曹操，担任祭酒'),
('50', '郭嘉', '207', '柳城', '109.25156153', '24.656370391', '因为水土不服，气候恶劣，再加上日夜急行又操劳过度，郭嘉患疾病去世'),
('51', '刘备', '161', '涿郡涿县', '115.98161971', '39.491065832', '出生'),
('52', '刘备', '184', '安喜县', '114.99649621', '38.52219884', '刘备在镇压起义的战斗中立下战功，而后又于中平三年（188年）参与镇压张纯叛乱的战斗，以前后军功被封为安喜县县尉'),
('53', '刘备', '191', '平原县', '116.44050471', '37.171221463', '刘备与青州刺史田楷一起对抗冀州牧袁绍，刘备因为累次建立功勋而升为试守平原县县令，后领平原国相'),
('54', '刘备', '194', '徐州', '117.29057543', '34.21266655', '曹操以为父报仇为名再度攻打徐州，徐州牧陶谦不能抵挡，向青州刺史田楷求救。田楷与刘备一起前往救援'),
('55', '刘备', '194', '小沛', '117.29699147', '26.498832942', '陶谦表刘备为豫州刺史，叫他驻军在小沛'),
('56', '刘备', '195', '徐州', '117.29057543', '34.21266655', '陶谦死后，麋竺率徐州人民迎接刘备做太守'),
('57', '刘备', '196', '豫州', '113.75938408', '34.771712921', '多次战败，前往许都投奔曹操。曹操给与刘备兵马粮草，让刘备做豫州牧'),
('58', '刘备', '198', '许都', '113.85847554', '34.041431611', '与曹操联合进攻吕布，吕布投降后，刘备力劝曹操杀死吕布。其后刘备与曹操回到许都，被封为左将军'),
('59', '刘备', '199', '小沛', '117.29699147', '26.498832942', '进军下邳，杀徐州刺史车胄，留关羽守下邳，行使太守的职责，自己回到小沛'),
('60', '刘备', '200', '平原县', '116.44050471', '37.171221463', '衣带诏事发。曹操亲自东征刘备，刘备战败逃往青州，随袁谭到平原'),
('61', '刘备', '200', '汝南', '114.36940889', '33.013140882', '离开袁绍，以连结刘表为由，带兵复到汝南'),
('62', '刘备', '201', '新野', '112.36654962', '32.526631779', '曹操亲自讨伐刘备，刘备往投刘表。刘表亲自到郊外迎接刘备，待以上宾之礼，遂屯于新野'),
('63', '刘备', '207', '隆中', '112.14807193', '32.06449063', '前往隆中拜访诸葛亮，三顾茅庐之后，诸葛亮向刘备献上了《隆中对》'),
('64', '刘备', '208', '江陵', '112.43145202', '30.048042985', '曹操大军突至，刘备退往江陵'),
('65', '刘备', '208', '赤壁', '113.90643686', '29.730665998', '刘备联合孙权，与周瑜、程普率领联军大败曹操于赤壁'),
('66', '刘备', '209', '南郡', '120.96520632', '31.362936847', '刘备与周瑜在南郡共攻曹仁'),
('67', '刘备', '210', '葭萌', '105.72233955', '32.338836976', '刘璋命令刘备攻击张鲁。刘备北至葭萌，驻军不前，厚树恩德以收众心'),
('68', '刘备', '214', '成都', '104.08153351', '30.655821878', '雒城被围近一年才被攻克，刘备乃与诸葛亮、张飞、赵云等共围成都'),
('69', '刘备', '215', '公安', '112.23650158', '30.064400687', '孙权派遣吕蒙袭取长沙、零陵、桂阳三郡。刘备于是率兵五万下公安，让关羽入益阳'),
('70', '刘备', '218', '汉中', '107.02943021', '33.073799908', '刘备率兵进攻汉中，派遣吴兰、雷铜等夺取武都，被曹洪所杀。'),
('71', '刘备', '219', '定军山', '106.67263799', '33.119669378', '刘备放弃阳平关，南渡沔水，于定军山扎营，夏侯渊率军前来争取定军山，被黄忠所杀。'),
('72', '刘备', '221', '秭归', '110.98444937', '30.831931643', '刘备以为关羽报仇的名义，发兵讨伐东吴'),
('73', '刘备', '222', '夷陵', '111.33252973', '30.774833327', '刘备派遣黄权督江北水军，自率陆军进军。秋七月，被吴将陆逊在夷陵之战中打败'),
('74', '刘备', '223', '白帝城', '123.4736614', '23.159977656', '刘备托孤于诸葛亮，夏四月二十四日（6月10日），刘备病逝，享年六十三岁'),
('75', '吕布', '161', '并州五原郡九原县', '109.96958801', '40.613396589', '出生'),
('76', '吕布', '189', '并州河内', '120.27634531', '27.610946094', '时任并州刺史的丁原担任骑都尉，在河内驻扎，任命吕布为主簿'),
('77', '吕布', '190', '洛阳', '112.4594213', '34.624262779', '汉灵帝死后，丁原接到何进的徵召，率领军队到洛阳'),
('78', '吕布', '192', '南阳', '112.53450131', '32.9965622', '投奔袁术'),
('79', '吕布', '193', '冀州', '115.58542988', '37.557086026', '投奔袁绍'),
('80', '吕布', '194', '濮阳', '115.03559747', '35.76759302', '张邈听从陈宫的意见，就同弟弟张超和陈宫等人迎接吕布，请他当兖州牧，占据濮阳'),
('81', '吕布', '195', '徐州', '117.29057543', '34.21266655', '被曹操击败，投奔刘备'),
('82', '吕布', '196', '丹阳', '119.6125006', '32.015920274', '趁刘备袁术相持，偷袭丹阳'),
('83', '吕布', '196', '小沛', '117.29699147', '26.498832942', '辕门射戟，给纪灵、刘备讲和'),
('84', '吕布', '198', '下邳', '117.91668788', '34.123943044', '被曹操攻打，退守'),
('85', '吕布', '199', '下邳', '117.91668788', '34.123943044', '投降，身死'),
('86', '孙权', '182', '吴郡富春', '119.95018496', '30.055816195', '出生'),
('87', '孙权', '184', '九江郡寿春县', '116.00753491', '29.711340559', '时任佐军司马的孙坚随朱儁征讨黄巾军。孙权与其母吴夫人等人都留居九江郡寿春县'),
('88', '孙权', '189', '庐江郡舒县', '117.2935773', '31.261327637', '长沙太守孙坚起兵响应讨伐董卓的关东（函谷关以东）联军时，孙权跟随长兄孙策迁居至庐江郡舒县'),
('89', '孙权', '191', '广陵郡江都县', '119.57660297', '32.440294506', '孙坚奉袁术之命讨伐荆州刺史刘表，不幸战死。丧事毕后全家迁往广陵郡江都县'),
('90', '孙权', '193', '曲阿', '95.807993519', '32.559785562', '孙策投奔袁术后，命吕范将孙权一家接到住在曲阿的舅舅吴景处'),
('91', '孙权', '194', '阜陵县', '116.58940001', '37.347132435', '朱治派人到曲阿迎接孙策母亲及孙权等幼弟，后来孙权跟着母亲迁往阜陵县'),
('92', '孙权', '200', '吴郡', '119.95018496', '30.055816195', '孙策去世，临终前命孙权接替其位。孙权被东汉朝廷册拜为讨虏将军，兼领会稽太守，驻守吴郡。'),
('93', '孙权', '208', '夷陵', '111.33252973', '30.774833327', '甘宁在夷陵被曹仁包围，孙权驰救甘宁，获胜而返'),
('94', '孙权', '211', '秣陵', '118.84656706', '31.958526869', '孙权将治所迁至秣陵'),
('95', '孙权', '213', '濡须坞', '118.84656706', '31.958526869', '与曹操对峙'),
('96', '孙权', '214', '皖城', '117.0636039', '30.530956568', '孙权率吕蒙、甘宁征讨皖城，虏获庐江太守朱光，获取人口数万'),
('97', '孙权', '221', '鄂州', '114.90160739', '30.396572173', '孙权自公安迁都鄂州，改鄂州为武昌，并随即修筑武昌城'),
('98', '孙权', '229', '武昌', '114.32254852', '30.559566984', '孙权于武昌（今湖北鄂城）正式登基为帝，建国号为吴'),
('99', '孙权', '234', '合肥新城', '117.23344266', '31.826577834', '孙权亲征合肥新城'),
('100', '孙权', '252', '蒋陵', '104.85052982', '26.58070408', '孙权在内殿驾崩，终年71岁，在位24年。谥号大皇帝，庙号太祖。葬于蒋陵'),
('101', '袁绍', '153', '汝南郡汝阳县', '114.36940889', '33.013140882', '出生'),
('102', '袁绍', '173', '濮阳', '115.03559747', '35.76759302', '出任濮阳县长，有清正能干的名声'),
('103', '袁绍', '179', '洛阳', '112.4594213', '34.624262779', '袁绍拒绝朝廷辟召，隐居在洛阳'),
('104', '袁绍', '184', '洛阳', '112.4594213', '34.624262779', '东汉朝廷被迫取消党禁，大赦天下党人。袁绍这才应大将军何进的辟召'),
('105', '袁绍', '189', '冀州', '115.58542988', '37.557086026', '董卓进京，袁绍不敢久留洛阳，他把朝廷所颁符节挂在上东门上，逃亡冀州'),
('106', '袁绍', '190', '山东', '120.30759989', '31.03605986', '关东州郡起兵讨董，推举袁绍为盟主'),
('107', '袁绍', '191', '界桥', '105.6993909', '30.262921978', '袁绍亲自领兵迎战公孙瓒，两军在界桥南二十里处交锋'),
('108', '袁绍', '192', '龙凑', '116.36555674', '37.441308455', '公孙瓒又派兵到龙凑攻打袁绍，结果再次被袁绍打败，之后就退守幽州'),
('109', '袁绍', '193', '薄落津', '122.26735801', '37.059897974', '南下'),
('110', '袁绍', '193', '常山', '118.51755663', '28.906997949', '联手吕布，与张燕、四营屠各、雁门乌桓在常山展开大战'),
('111', '袁绍', '198', '幽州', '105.05915202', '24.052688213', '袁绍亲领大军攻打幽州，所向披靡'),
('112', '袁绍', '200', '黎阳', '116.3091732', '27.256141529', '他派颜良包围白马，自己率领大军抵黎阳'),
('113', '袁绍', '200', '阳武', '113.94662374', '35.071163864', '曹军退还官渡后，袁军集结在阳武'),
('114', '袁绍', '200', '冀州', '115.58542988', '37.557086026', '兵败'),
('115', '袁绍', '202', '冀州', '115.58542988', '37.557086026', '身死'),
('116', '周瑜', '175', '庐江', '117.2935773', '31.261327637', '出生'),
('117', '周瑜', '190', '寿春', '116.80556277', '32.561546151', '周瑜慕名前去拜访孙策，劝孙策带母亲弟弟移居庐江舒县'),
('118', '周瑜', '195', '历阳', '118.35951255', '31.748243816', '周瑜率兵迎接孙策，给他以大力支持'),
('119', '周瑜', '196', '寿春', '116.80556277', '32.561546151', '袁术派其堂弟袁胤取代周尚任丹阳太守，周瑜随周尚到了寿春'),
('120', '周瑜', '197', '居巢', '117.8955762', '31.629002429', '周瑜看出袁术最终不会有什么成就，所以只请求做居巢县长，欲借机回江东'),
('121', '周瑜', '198', '吴郡', '119.95018496', '30.055816195', '周瑜和鲁肃一同回到吴郡。孙策闻周瑜归来，亲自出迎'),
('122', '周瑜', '199', '皖城', '117.0636039', '30.530956568', '孙策率周瑜等人攻破皖城，虏获袁术手下刘勋家人及他们部下的男女亲族，其中桥公二女皆国色天姿，孙策自纳大乔，周瑜纳小乔'),
('123', '周瑜', '200', '江夏', '114.32855126', '30.381564218', '讨伐'),
('124', '周瑜', '200', '豫章', '113.05578224', '23.044897281', '讨伐'),
('125', '周瑜', '200', '庐陵', '115.00051072', '27.119726826', '讨伐'),
('126', '周瑜', '200', '巴丘', '123.4736614', '41.809018744', '留守'),
('127', '周瑜', '200', '吴郡', '119.95018496', '30.055816195', '孙策遇刺身亡，周瑜从外地带兵前来奔丧，留在吴郡孙权身边任中护军'),
('128', '周瑜', '208', '江夏', '114.32855126', '30.381564218', '孙权征讨江夏的黄祖。周瑜为前部大督，抓获黄祖'),
('129', '周瑜', '208', '赤壁', '113.90643686', '29.730665998', '周瑜及程普等领三万人抗曹，途中在赤壁两军遇上'),
('130', '周瑜', '210', '巴丘', '123.4736614', '41.809018744', '孙权批准了周瑜提出征伐益州的方案，周瑜返回驻地江陵，行至巴丘，突然病卒'),
('131', '诸葛亮', '181', '琅琊郡阳都县', '99.615991773', '28.537812466', '出生'),
('132', '诸葛亮', '189', '豫章', '113.05578224', '23.044897281', '与弟弟诸葛均一起跟随由袁术任命为豫章太守的叔父诸葛玄到豫章赴任'),
('133', '诸葛亮', '197', '隆中', '112.14807193', '32.06449063', '隐居'),
('134', '诸葛亮', '208', '柴桑', '115.91740154', '29.614804909', '刘备败走夏口，而孙权之前又派鲁肃到来观察情况，并向刘备建议向孙权求救，诸葛亮便自荐到柴桑作说客'),
('135', '诸葛亮', '208', '荆州', '112.24552263', '30.340842108', '刘备趁曹操北归之机，听从诸葛亮之计，平定荆南四郡'),
('136', '诸葛亮', '214', '成都', '104.08153351', '30.655821878', '诸葛亮听闻刘备攻打成都，且军师庞统中流矢身亡。留关羽留守荆州，与张飞、赵云率兵溯长江而上，攻克巴东，与刘备会师成都'),
('137', '诸葛亮', '221', '永安', '120.23820977', '22.826048422', '刘备病重，召诸葛亮到永安，与李严一起托付后事'),
('138', '诸葛亮', '226', '沔阳', '106.67942595', '33.159804747', '出师北伐'),
('139', '诸葛亮', '228', '祁山', '115.36310841', '25.647488858', '事先扬声走斜谷道取郿，让赵云、邓芝设疑兵吸引曹真重兵，自己率大军攻祁山'),
('140', '诸葛亮', '228', '汉中', '107.02943021', '33.073799908', '征战失利，返回汉中'),
('141', '诸葛亮', '228', '散关', '107.24457537', '34.368915643', '诸葛亮趁魏兵东下，关中虚弱，趁机北伐，出兵散关围陈仓'),
('142', '诸葛亮', '229', '建威', '123.42372091', '41.78689972', '诸葛亮遣陈式攻武都、阴平二郡。雍州刺史郭淮引兵救之，亮自出至建威，郭淮退，遂得二郡'),
('143', '诸葛亮', '230', '城固', '107.34061258', '33.162399385', '魏军三路进攻汉中，司马懿走西城，张郃走子午谷，曹真走斜谷。诸葛亮驻军于城固'),
('144', '诸葛亮', '231', '祁山', '115.36310841', '25.647488858', '出师北伐'),
('145', '诸葛亮', '232', '黄沙', '113.24682101', '23.11620405', '诸葛亮在黄沙休兵劝农，制作木牛流马等，并且练兵讲武，准备再次北伐'),
('146', '诸葛亮', '234', '武功五丈原', '108.20655106', '34.266137668', '诸葛亮经过三年劝农讲武的准备，率大军出斜谷道，据武功五丈原，屯田于渭滨，同时派使臣到东吴，希望孙权能同时攻魏'),
('147', '诸葛亮', '234', '汉中定军山', '106.67263799', '33.119669378', '遗言命令部下将自己葬在汉中定军山，依山势修建坟墓，墓穴仅能容纳下棺材'),
('1', '曹操', '155', '沛国谯县', '113.10161873', '23.073078561', '出生'),
('2', '曹操', '174', '洛阳', '112.4594213', '34.624262779', '举为孝廉，入京都洛阳为郎。不久，被任命为洛阳北部尉'),
('3', '曹操', '178', '沛国谯县', '113.10161873', '23.073078561', '因堂妹夫濦强侯宋奇被宦官诛杀，受到牵连，被免去官职。其后，在洛阳无事可做，回到家乡谯县闲居'),
('4', '曹操', '186', '洛阳', '112.4594213', '34.624262779', '被朝廷征召，任命为议郎'),
('5', '曹操', '184', '颍川', '118.15436066', '24.717194935', '黄巾起义爆发，曹操被拜为骑都尉，受命与皇甫嵩等人合军进攻颍川的黄巾军'),
('6', '曹操', '185', '济南', '117.12639941', '36.656554202', '破黄巾军，斩首数万级。随之迁为济南相'),
('7', '曹操', '188', '洛阳', '112.4594213', '34.624262779', '汉灵帝为巩固统治，设置西园八校尉，曹操因其家世被任命为八校尉中的典军校尉'),
('8', '曹操', '189', '陈留', '114.54084206', '34.682950476', '曹操见董卓倒行逆施，不愿与其合作，遂改易姓名逃出京师洛阳（今洛阳东）'),
('9', '曹操', '190', '荥阳汴水', '113.3894228', '34.7938105', '与董卓大将徐荣交锋，因为士兵数量悬殊，曹操大败，士卒死伤大半，自己也被流矢所伤，幸得堂弟曹洪所救，幸免于难'),
('10', '曹操', '191', '东郡', '106.50208803', '29.508865979', '大败于毒、白绕、眭固、於扶罗等，袁绍表其为东郡太守。'),
('11', '曹操', '192', '兖州', '116.79011515', '35.557952373', '青州黄巾军大获发展，连破兖州（治昌邑，今山东巨野东南）郡县，阵斩兖州刺史刘岱。济北相鲍信等人迎曹操出任兖州牧。'),
('12', '曹操', '193', '徐州', '117.29057543', '34.21266655', '徐州牧陶谦率军攻入兖州南部的任城，曹操率军征讨陶谦，攻克徐州十余城。'),
('13', '曹操', '194', '东海', '118.75956509', '34.547918627', '曹操再征徐州，略地至东海'),
('14', '曹操', '195', '兖州', '116.79011515', '35.557952373', '曹操整军再战吕布，三败之，破定陶（今山东定陶）、廪丘（今山东郓城西北）等，平定兖州。'),
('15', '曹操', '196', '许县', '113.85847554', '34.041431611', '曹操迎汉献帝。辛亥，汉献帝封曹操为司隶校尉，录尚书事。庚申，迁都许县。'),
('16', '曹操', '197', '淯水', '112.43542522', '33.496185804', '曹操讨伐张绣，军队驻扎在淯水，张绣举众投降，旋即复叛，长子曹昂、侄子曹安民、猛将典韦战死。'),
('17', '曹操', '198', '徐州', '117.29057543', '34.21266655', '曹操东征徐州，进攻久与他为敌的吕布。在曹军攻势之下，吕布军上下离心，十二月，吕布部将魏续、宋宪等生擒陈宫归降曹操。吕布见大势已去，下城投降。'),
('18', '曹操', '199', '官渡', '102.75048171', '25.021196424', '曹操自率军屯于官渡（今中牟北），准备迎击袁绍。'),
('19', '曹操', '200', '白马', '114.52555317', '35.581045401', '曹操亲自率兵北上解白马之围'),
('20', '曹操', '200', '官渡', '102.75048171', '25.021196424', '袁绍大军连营而进，东西数十里，依沙堆为屯，进逼官渡。曹操分兵坚守营垒，伺机而动'),
('21', '曹操', '200', '乌巢', '116.32999364', '39.831768098', '曹操军至乌巢，命四面放火，袁军大乱，淳于琼拒营死守。大破袁军，斩淳于琼等，尽燔其粮草。'),
('22', '曹操', '204', '邺城', '114.62642695', '36.340765981', '曹操乘袁尚出兵攻打袁谭之机，进军围攻邺城（今河北邯郸临漳西一带）'),
('23', '曹操', '205', '冀州', '115.58542988', '37.557086026', '曹操又以负约为名，攻灭袁谭，冀、青二州平定'),
('24', '曹操', '206', '并州', '112.51373959', '37.869249264', '曹操攻灭高干，平定并州'),
('25', '曹操', '207', '乌桓', '116.34862521', '39.732555236', '曹操为了肃清袁氏残余势力，也为了彻底解决三郡乌桓入塞为害问题，决定远征乌桓'),
('26', '曹操', '208', '荆州', '112.24552263', '30.340842108', '进军南征荆州刘表'),
('27', '曹操', '208', '当阳长坂', '117.26464143', '24.793699299', '怕江陵落入刘备之手，遂亲率五千骑兵从襄阳（今湖北襄樊）疾驰三百里，在当阳长坂（今湖北当阳东北）将刘备追上，大破其军，随后进占江陵'),
('28', '曹操', '208', '赤壁', '113.90643686', '29.730665998', '曹操自江陵东下，至赤壁（今湖北武昌县西赤矶山）与孙、刘联军接战'),
('29', '曹操', '211', '关中', '114.53354961', '30.721807717', '曹操率大军亲征关中，大败关中联军'),
('30', '曹操', '213', '濡须口', '118.10746204', '31.740862209', '起兵号称四十万，亲自南征孙权'),
('31', '曹操', '215', '汉中', '107.02943021', '33.073799908', '率十万大军亲征汉中张鲁'),
('32', '曹操', '217', '濡须口', '118.10746204', '31.740862209', '曹操再次南征，率军猛攻濡须口，击败孙权'),
('33', '曹操', '218', '长安', '114.54561161', '38.043256136', '曹操亲率大军赶往关中，坐镇长安，以便随时指挥汉中战局'),
('34', '曹操', '219', '洛阳', '112.4594213', '34.624262779', '曹操从关中赶到洛阳，亲自指挥救援樊城'),
('35', '曹操', '220', '邺城西郊高陵', '114.62642695', '36.340765981', '曹操还军洛阳。当月，病逝在洛阳，终年六十六岁，谥曰武王，于二月廿一丁卯日（4月11日）被安葬于邺城西郊的高陵。'),
('36', '关羽', '160', '河东郡解县', '117.25841295', '39.134487326', '出生'),
('37', '关羽', '184', '平原', '116.44050471', '37.171221463', '刘备担任平原相时，任命关羽、张飞为别部司马，分统部曲'),
('38', '关羽', '194', '徐州', '117.29057543', '34.21266655', '曹操因曹嵩被杀而迁怒于陶谦，于是发兵攻打徐州。陶谦求救于刘备，刘备和关羽率千余人前往救援，后刘备担任徐州牧'),
('39', '关羽', '198', '许昌', '113.85847554', '34.041431612', '刘备与曹操共擒吕布于下邳，夺得徐州。曹操任车胄为徐州刺史。刘备、关羽、张飞等人便跟随曹操班师回许昌'),
('40', '关羽', '200', '白马', '114.52555317', '35.581045401', '袁绍派大将颜良、淳于琼、郭图等攻东郡太守刘延于白马，关羽望见颜良的麾盖，策马冲锋，刺死颜良于万军之中，又拔出佩刀斩得颜良的首级，然后返还'),
('41', '关羽', '208', '夏口', '116.92837443', '34.450388987', '曹操率领大军南下，刘备南逃，另遣关羽乘数百艘船驶向江陵（今湖北荆州）会合，但刘备于途中当阳（今湖北宜昌）长坂坡被曹操军追至，幸而关羽驶至汉津（今湖北荆门），一同乘船至夏口（今湖北武汉）'),
('42', '关羽', '211', '荆州', '112.24552263', '30.340842108', '刘备入蜀助刘璋防御张鲁，张飞、赵云、诸葛亮与关羽共守荆州'),
('43', '关羽', '219', '樊城', '112.14259892', '32.050572375', '关羽留南郡太守糜芳守卫江陵，将军傅士仁驻守公安，自己率领大军攻打襄阳的吕常和樊城的曹仁'),
('44', '关羽', '219', '麦城', '110.37471165', '20.03300776', '关羽的将士都无心再战了，士卒渐渐溃散，退至麦城'),
('45', '关羽', '219', '临沮', '111.84538618', '31.781129707', '关羽率数十骑出逃，一路突围至距益州不过一二十里的临沮（今湖北省襄樊市南漳县），遇潘璋部将马忠的埋伏，被擒，和长子关平于临沮被害'),
('46', '郭嘉', '170', '颍川阳翟', '118.15436066', '24.717194935', '出生'),
('47', '郭嘉', '191', '冀州', '115.58542988', '37.557086026', '北行拜访袁绍'),
('48', '郭嘉', '191', '颍川', '118.15436066', '24.717194935', '离开了袁绍。就这样，郭嘉一直赋闲了六年'),
('49', '郭嘉', '196', '许县', '113.85847554', '34.041431611', '投奔并跟随曹操，担任祭酒'),
('50', '郭嘉', '207', '柳城', '109.25156153', '24.656370391', '因为水土不服，气候恶劣，再加上日夜急行又操劳过度，郭嘉患疾病去世'),
('51', '刘备', '161', '涿郡涿县', '115.98161971', '39.491065832', '出生'),
('52', '刘备', '184', '安喜县', '114.99649621', '38.52219884', '刘备在镇压起义的战斗中立下战功，而后又于中平三年（188年）参与镇压张纯叛乱的战斗，以前后军功被封为安喜县县尉'),
('53', '刘备', '191', '平原县', '116.44050471', '37.171221463', '刘备与青州刺史田楷一起对抗冀州牧袁绍，刘备因为累次建立功勋而升为试守平原县县令，后领平原国相'),
('54', '刘备', '194', '徐州', '117.29057543', '34.21266655', '曹操以为父报仇为名再度攻打徐州，徐州牧陶谦不能抵挡，向青州刺史田楷求救。田楷与刘备一起前往救援'),
('55', '刘备', '194', '小沛', '117.29699147', '26.498832942', '陶谦表刘备为豫州刺史，叫他驻军在小沛'),
('56', '刘备', '195', '徐州', '117.29057543', '34.21266655', '陶谦死后，麋竺率徐州人民迎接刘备做太守'),
('57', '刘备', '196', '豫州', '113.75938408', '34.771712921', '多次战败，前往许都投奔曹操。曹操给与刘备兵马粮草，让刘备做豫州牧'),
('58', '刘备', '198', '许都', '113.85847554', '34.041431611', '与曹操联合进攻吕布，吕布投降后，刘备力劝曹操杀死吕布。其后刘备与曹操回到许都，被封为左将军'),
('59', '刘备', '199', '小沛', '117.29699147', '26.498832942', '进军下邳，杀徐州刺史车胄，留关羽守下邳，行使太守的职责，自己回到小沛'),
('60', '刘备', '200', '平原县', '116.44050471', '37.171221463', '衣带诏事发。曹操亲自东征刘备，刘备战败逃往青州，随袁谭到平原'),
('61', '刘备', '200', '汝南', '114.36940889', '33.013140882', '离开袁绍，以连结刘表为由，带兵复到汝南'),
('62', '刘备', '201', '新野', '112.36654962', '32.526631779', '曹操亲自讨伐刘备，刘备往投刘表。刘表亲自到郊外迎接刘备，待以上宾之礼，遂屯于新野'),
('63', '刘备', '207', '隆中', '112.14807193', '32.06449063', '前往隆中拜访诸葛亮，三顾茅庐之后，诸葛亮向刘备献上了《隆中对》'),
('64', '刘备', '208', '江陵', '112.43145202', '30.048042985', '曹操大军突至，刘备退往江陵'),
('65', '刘备', '208', '赤壁', '113.90643686', '29.730665998', '刘备联合孙权，与周瑜、程普率领联军大败曹操于赤壁'),
('66', '刘备', '209', '南郡', '120.96520632', '31.362936847', '刘备与周瑜在南郡共攻曹仁'),
('67', '刘备', '210', '葭萌', '105.72233955', '32.338836976', '刘璋命令刘备攻击张鲁。刘备北至葭萌，驻军不前，厚树恩德以收众心'),
('68', '刘备', '214', '成都', '104.08153351', '30.655821878', '雒城被围近一年才被攻克，刘备乃与诸葛亮、张飞、赵云等共围成都'),
('69', '刘备', '215', '公安', '112.23650158', '30.064400687', '孙权派遣吕蒙袭取长沙、零陵、桂阳三郡。刘备于是率兵五万下公安，让关羽入益阳'),
('70', '刘备', '218', '汉中', '107.02943021', '33.073799908', '刘备率兵进攻汉中，派遣吴兰、雷铜等夺取武都，被曹洪所杀。'),
('71', '刘备', '219', '定军山', '106.67263799', '33.119669378', '刘备放弃阳平关，南渡沔水，于定军山扎营，夏侯渊率军前来争取定军山，被黄忠所杀。'),
('72', '刘备', '221', '秭归', '110.98444937', '30.831931643', '刘备以为关羽报仇的名义，发兵讨伐东吴'),
('73', '刘备', '222', '夷陵', '111.33252973', '30.774833327', '刘备派遣黄权督江北水军，自率陆军进军。秋七月，被吴将陆逊在夷陵之战中打败'),
('74', '刘备', '223', '白帝城', '123.4736614', '23.159977656', '刘备托孤于诸葛亮，夏四月二十四日（6月10日），刘备病逝，享年六十三岁'),
('75', '吕布', '161', '并州五原郡九原县', '109.96958801', '40.613396589', '出生'),
('76', '吕布', '189', '并州河内', '120.27634531', '27.610946094', '时任并州刺史的丁原担任骑都尉，在河内驻扎，任命吕布为主簿'),
('77', '吕布', '190', '洛阳', '112.4594213', '34.624262779', '汉灵帝死后，丁原接到何进的徵召，率领军队到洛阳'),
('78', '吕布', '192', '南阳', '112.53450131', '32.9965622', '投奔袁术'),
('79', '吕布', '193', '冀州', '115.58542988', '37.557086026', '投奔袁绍'),
('80', '吕布', '194', '濮阳', '115.03559747', '35.76759302', '张邈听从陈宫的意见，就同弟弟张超和陈宫等人迎接吕布，请他当兖州牧，占据濮阳'),
('81', '吕布', '195', '徐州', '117.29057543', '34.21266655', '被曹操击败，投奔刘备'),
('82', '吕布', '196', '丹阳', '119.6125006', '32.015920274', '趁刘备袁术相持，偷袭丹阳'),
('83', '吕布', '196', '小沛', '117.29699147', '26.498832942', '辕门射戟，给纪灵、刘备讲和'),
('84', '吕布', '198', '下邳', '117.91668788', '34.123943044', '被曹操攻打，退守'),
('85', '吕布', '199', '下邳', '117.91668788', '34.123943044', '投降，身死'),
('86', '孙权', '182', '吴郡富春', '119.95018496', '30.055816195', '出生'),
('87', '孙权', '184', '九江郡寿春县', '116.00753491', '29.711340559', '时任佐军司马的孙坚随朱儁征讨黄巾军。孙权与其母吴夫人等人都留居九江郡寿春县'),
('88', '孙权', '189', '庐江郡舒县', '117.2935773', '31.261327637', '长沙太守孙坚起兵响应讨伐董卓的关东（函谷关以东）联军时，孙权跟随长兄孙策迁居至庐江郡舒县'),
('89', '孙权', '191', '广陵郡江都县', '119.57660297', '32.440294506', '孙坚奉袁术之命讨伐荆州刺史刘表，不幸战死。丧事毕后全家迁往广陵郡江都县'),
('90', '孙权', '193', '曲阿', '95.807993519', '32.559785562', '孙策投奔袁术后，命吕范将孙权一家接到住在曲阿的舅舅吴景处'),
('91', '孙权', '194', '阜陵县', '116.58940001', '37.347132435', '朱治派人到曲阿迎接孙策母亲及孙权等幼弟，后来孙权跟着母亲迁往阜陵县'),
('92', '孙权', '200', '吴郡', '119.95018496', '30.055816195', '孙策去世，临终前命孙权接替其位。孙权被东汉朝廷册拜为讨虏将军，兼领会稽太守，驻守吴郡。'),
('93', '孙权', '208', '夷陵', '111.33252973', '30.774833327', '甘宁在夷陵被曹仁包围，孙权驰救甘宁，获胜而返'),
('94', '孙权', '211', '秣陵', '118.84656706', '31.958526869', '孙权将治所迁至秣陵'),
('95', '孙权', '213', '濡须坞', '118.84656706', '31.958526869', '与曹操对峙'),
('96', '孙权', '214', '皖城', '117.0636039', '30.530956568', '孙权率吕蒙、甘宁征讨皖城，虏获庐江太守朱光，获取人口数万'),
('97', '孙权', '221', '鄂州', '114.90160739', '30.396572173', '孙权自公安迁都鄂州，改鄂州为武昌，并随即修筑武昌城'),
('98', '孙权', '229', '武昌', '114.32254852', '30.559566984', '孙权于武昌（今湖北鄂城）正式登基为帝，建国号为吴'),
('99', '孙权', '234', '合肥新城', '117.23344266', '31.826577834', '孙权亲征合肥新城'),
('100', '孙权', '252', '蒋陵', '104.85052982', '26.58070408', '孙权在内殿驾崩，终年71岁，在位24年。谥号大皇帝，庙号太祖。葬于蒋陵'),
('101', '袁绍', '153', '汝南郡汝阳县', '114.36940889', '33.013140882', '出生'),
('102', '袁绍', '173', '濮阳', '115.03559747', '35.76759302', '出任濮阳县长，有清正能干的名声'),
('103', '袁绍', '179', '洛阳', '112.4594213', '34.624262779', '袁绍拒绝朝廷辟召，隐居在洛阳'),
('104', '袁绍', '184', '洛阳', '112.4594213', '34.624262779', '东汉朝廷被迫取消党禁，大赦天下党人。袁绍这才应大将军何进的辟召'),
('105', '袁绍', '189', '冀州', '115.58542988', '37.557086026', '董卓进京，袁绍不敢久留洛阳，他把朝廷所颁符节挂在上东门上，逃亡冀州'),
('106', '袁绍', '190', '山东', '120.30759989', '31.03605986', '关东州郡起兵讨董，推举袁绍为盟主'),
('107', '袁绍', '191', '界桥', '105.6993909', '30.262921978', '袁绍亲自领兵迎战公孙瓒，两军在界桥南二十里处交锋'),
('108', '袁绍', '192', '龙凑', '116.36555674', '37.441308455', '公孙瓒又派兵到龙凑攻打袁绍，结果再次被袁绍打败，之后就退守幽州'),
('109', '袁绍', '193', '薄落津', '122.26735801', '37.059897974', '南下'),
('110', '袁绍', '193', '常山', '118.51755663', '28.906997949', '联手吕布，与张燕、四营屠各、雁门乌桓在常山展开大战'),
('111', '袁绍', '198', '幽州', '105.05915202', '24.052688213', '袁绍亲领大军攻打幽州，所向披靡'),
('112', '袁绍', '200', '黎阳', '116.3091732', '27.256141529', '他派颜良包围白马，自己率领大军抵黎阳'),
('113', '袁绍', '200', '阳武', '113.94662374', '35.071163864', '曹军退还官渡后，袁军集结在阳武'),
('114', '袁绍', '200', '冀州', '115.58542988', '37.557086026', '兵败'),
('115', '袁绍', '202', '冀州', '115.58542988', '37.557086026', '身死'),
('116', '周瑜', '175', '庐江', '117.2935773', '31.261327637', '出生'),
('117', '周瑜', '190', '寿春', '116.80556277', '32.561546151', '周瑜慕名前去拜访孙策，劝孙策带母亲弟弟移居庐江舒县'),
('118', '周瑜', '195', '历阳', '118.35951255', '31.748243816', '周瑜率兵迎接孙策，给他以大力支持'),
('119', '周瑜', '196', '寿春', '116.80556277', '32.561546151', '袁术派其堂弟袁胤取代周尚任丹阳太守，周瑜随周尚到了寿春'),
('120', '周瑜', '197', '居巢', '117.8955762', '31.629002429', '周瑜看出袁术最终不会有什么成就，所以只请求做居巢县长，欲借机回江东'),
('121', '周瑜', '198', '吴郡', '119.95018496', '30.055816195', '周瑜和鲁肃一同回到吴郡。孙策闻周瑜归来，亲自出迎'),
('122', '周瑜', '199', '皖城', '117.0636039', '30.530956568', '孙策率周瑜等人攻破皖城，虏获袁术手下刘勋家人及他们部下的男女亲族，其中桥公二女皆国色天姿，孙策自纳大乔，周瑜纳小乔'),
('123', '周瑜', '200', '江夏', '114.32855126', '30.381564218', '讨伐'),
('124', '周瑜', '200', '豫章', '113.05578224', '23.044897281', '讨伐'),
('125', '周瑜', '200', '庐陵', '115.00051072', '27.119726826', '讨伐'),
('126', '周瑜', '200', '巴丘', '123.4736614', '41.809018744', '留守'),
('127', '周瑜', '200', '吴郡', '119.95018496', '30.055816195', '孙策遇刺身亡，周瑜从外地带兵前来奔丧，留在吴郡孙权身边任中护军'),
('128', '周瑜', '208', '江夏', '114.32855126', '30.381564218', '孙权征讨江夏的黄祖。周瑜为前部大督，抓获黄祖'),
('129', '周瑜', '208', '赤壁', '113.90643686', '29.730665998', '周瑜及程普等领三万人抗曹，途中在赤壁两军遇上'),
('130', '周瑜', '210', '巴丘', '123.4736614', '41.809018744', '孙权批准了周瑜提出征伐益州的方案，周瑜返回驻地江陵，行至巴丘，突然病卒'),
('131', '诸葛亮', '181', '琅琊郡阳都县', '99.615991773', '28.537812466', '出生'),
('132', '诸葛亮', '189', '豫章', '113.05578224', '23.044897281', '与弟弟诸葛均一起跟随由袁术任命为豫章太守的叔父诸葛玄到豫章赴任'),
('133', '诸葛亮', '197', '隆中', '112.14807193', '32.06449063', '隐居'),
('134', '诸葛亮', '208', '柴桑', '115.91740154', '29.614804909', '刘备败走夏口，而孙权之前又派鲁肃到来观察情况，并向刘备建议向孙权求救，诸葛亮便自荐到柴桑作说客'),
('135', '诸葛亮', '208', '荆州', '112.24552263', '30.340842108', '刘备趁曹操北归之机，听从诸葛亮之计，平定荆南四郡'),
('136', '诸葛亮', '214', '成都', '104.08153351', '30.655821878', '诸葛亮听闻刘备攻打成都，且军师庞统中流矢身亡。留关羽留守荆州，与张飞、赵云率兵溯长江而上，攻克巴东，与刘备会师成都'),
('137', '诸葛亮', '221', '永安', '120.23820977', '22.826048422', '刘备病重，召诸葛亮到永安，与李严一起托付后事'),
('138', '诸葛亮', '226', '沔阳', '106.67942595', '33.159804747', '出师北伐'),
('139', '诸葛亮', '228', '祁山', '115.36310841', '25.647488858', '事先扬声走斜谷道取郿，让赵云、邓芝设疑兵吸引曹真重兵，自己率大军攻祁山'),
('140', '诸葛亮', '228', '汉中', '107.02943021', '33.073799908', '征战失利，返回汉中'),
('141', '诸葛亮', '228', '散关', '107.24457537', '34.368915643', '诸葛亮趁魏兵东下，关中虚弱，趁机北伐，出兵散关围陈仓'),
('142', '诸葛亮', '229', '建威', '123.42372091', '41.78689972', '诸葛亮遣陈式攻武都、阴平二郡。雍州刺史郭淮引兵救之，亮自出至建威，郭淮退，遂得二郡'),
('143', '诸葛亮', '230', '城固', '107.34061258', '33.162399385', '魏军三路进攻汉中，司马懿走西城，张郃走子午谷，曹真走斜谷。诸葛亮驻军于城固'),
('144', '诸葛亮', '231', '祁山', '115.36310841', '25.647488858', '出师北伐'),
('145', '诸葛亮', '232', '黄沙', '113.24682101', '23.11620405', '诸葛亮在黄沙休兵劝农，制作木牛流马等，并且练兵讲武，准备再次北伐'),
('146', '诸葛亮', '234', '武功五丈原', '108.20655106', '34.266137668', '诸葛亮经过三年劝农讲武的准备，率大军出斜谷道，据武功五丈原，屯田于渭滨，同时派使臣到东吴，希望孙权能同时攻魏'),
('147', '诸葛亮', '234', '汉中定军山', '106.67263799', '33.119669378', '遗言命令部下将自己葬在汉中定军山，依山势修建坟墓，墓穴仅能容纳下棺材');

-- --------------------------------------------------------

--
-- 表的结构 `sheet2`
--

CREATE TABLE `sheet2` (
  `id` int(255) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_icelandic_ci DEFAULT NULL,
  `time` int(255) DEFAULT NULL,
  `p_a` varchar(255) CHARACTER SET utf8 COLLATE utf8_icelandic_ci DEFAULT NULL,
  `p_b` varchar(255) CHARACTER SET utf8 COLLATE utf8_icelandic_ci DEFAULT NULL,
  `place` varchar(255) CHARACTER SET utf8 COLLATE utf8_icelandic_ci DEFAULT NULL,
  `x` double(255,0) DEFAULT NULL,
  `y` double(255,0) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `sheet2`
--

INSERT INTO `sheet2` (`id`, `name`, `time`, `p_a`, `p_b`, `place`, `x`, `y`) VALUES
(1, '曹操攻董卓荥阳之战', 190, '曹操', '董卓', '荥阳', 113, 35),
(2, '孙坚鲁阳退敌', 190, '孙坚', '董卓', '鲁阳', 113, 34),
(3, '董卓袭王匡河阳津之战', 190, '董卓', '王匡', '河阳津', 108, 23),
(4, '孙坚斩华雄阳人之战', 190, '孙坚', '华雄', '阳人城', 113, 34),
(5, '孙坚攻董卓洛阳诸陵之战 ', 191, '孙坚', '董卓', '诸陵', 115, 38),
(6, '袁绍袭孙坚阳城之战', 191, '袁绍', '孙坚', '阳城', 112, 35),
(7, '孙坚击刘表襄阳之战', 191, '孙坚', '刘表', '襄阳', 112, 32),
(8, '曹操击黑山军濮阳之战', 191, '曹操', '黑山军', '濮阳', 115, 36),
(9, '陶谦破黄巾军徐州之战', 191, '陶谦', '黄巾军', '徐州', 117, 34),
(10, '袁绍与公孙瓒界桥之战', 192, '袁绍', '公孙瓒', '界桥', 106, 30),
(11, '公孙瓒击袁绍巨马水之战', 192, '公孙瓒', '袁绍', '巨马水', 107, 29),
(12, '袁术击袁遗扬州之战', 192, '袁术', '袁遗', '扬州', 119, 32),
(13, '李催等进犯长安之战', 192, '李催', '长安守军', '长安', 115, 38),
(14, '曹操击黑山军武阳之战', 192, '曹操', '黑山军', '武阳', 104, 30),
(15, '曹操破黄巾军兖州之战', 192, '曹操', '黄巾军', '兖州', 117, 36),
(16, '曹操击袁术封丘之战', 193, '曹操', '袁术', '封丘', 114, 35),
(17, '曹操攻陶谦彭城之战', 193, '曹操', '陶谦', '彭城', 119, 25),
(18, '公孙瓒灭刘虞幽州之战', 193, '公孙瓒', '刘虞', '幽州', 117, 39),
(19, '袁谭攻田楷青州之战', 193, '袁谭', '田楷', '青州', 118, 37),
(20, '袁绍攻黑山军常山之战', 193, '袁绍', '黑山军', '常山', 119, 29),
(21, '吴景攻周昕丹阳之战', 194, '吴景', '周昕', '丹阳', 120, 32),
(22, '孙策攻陆康庐江之战', 194, '孙策', '陆康', '庐江', 117, 31),
(23, '孙策攻刘繇曲阿之战', 195, '孙策', '刘繇', '曲阿', 96, 33),
(24, '刘繇攻诸葛玄、笮融豫章之战', 195, '刘繇', '诸葛玄', '豫章', 116, 29),
(25, '李催、郭汜攻杨奉、董承弘农之战', 195, '李催', '杨奉', '弘农', 114, 35),
(26, '袁绍攻臧洪东郡之战', 195, '袁绍', '臧洪', '东郡', 102, 35),
(27, '曹操攻吕布定陶之战', 195, '曹操', '吕布', '定陶', 116, 35),
(28, '吕布袭刘备下邳之战', 196, '吕布', '刘备', '下邳', 118, 34),
(29, '郝萌袭吕布徐州之战', 196, '郝萌', '吕布', '徐州', 117, 34),
(30, '孙策攻王朗会稽之战', 196, '孙策', '王朗', '会稽', 121, 30),
(31, '曹操攻杨奉梁县之战', 196, '曹操', '杨奉', '梁县', 113, 34),
(32, '曹操攻张绣淯水之战', 197, '曹操', '张绣', '淯水', 112, 34),
(33, '曹操攻袁术蕲阳之战', 197, '曹操', '袁术', '蕲阳', 115, 30),
(34, '曹操攻张绣湖阳之战', 197, '曹操', '张绣', '湖阳', 117, 27),
(35, '吕范、徐逸攻陈璃海西之战', 197, '吕范', '陈璃', '海西', 97, 37),
(36, '吕布破袁术下邳之战', 197, '吕布', '袁术', '下邳', 118, 34),
(37, '袁术灭陈王刘庞淮阳之战', 197, '袁术', '刘庞', '淮阳', 115, 34),
(38, '吕布攻臧霸莒城之战', 197, '吕布', '臧霸', '莒城', 119, 35),
(39, '袁绍灭公孙瓒易京之战', 198, '袁绍', '公孙瓒', '易京', 117, 39),
(40, '段煨灭李催关中之战', 198, '段煨', '李催', '关中', 115, 31),
(41, '曹操攻张绣穰城之战', 198, '曹操', '张绣', '穰城', 102, 35),
(42, '曹操灭吕布下邳之战', 198, '曹操', '吕布', '下邳', 118, 34),
(43, '曹操灭眭固射犬之战', 199, '曹操', '眭固', '射犬', 114, 34),
(44, '刘岱攻刘备小沛之战', 199, '刘岱', '刘备', '小沛', 117, 26),
(45, '孙策袭刘勋皖城之战', 199, '孙策', '刘勋', '皖城', 117, 31),
(46, '孙策攻黄祖沙羡之战', 199, '孙策', '黄祖', '沙羡', 114, 31),
(47, '孙策平邹佗、严白虎之战', 199, '孙策', '邹佗', '吴郡', 120, 30),
(48, '刘表破张怿长沙之战', 200, '刘表', '张怿', '长沙', 113, 28),
(49, '刘馥平定扬州之战', 200, '刘馥', '叛军', '扬州', 119, 32),
(50, '张鲁据汉中之战', 200, '张鲁', '叛军', '汉中', 107, 33),
(51, '刘璋平赵韪益州之战', 200, '刘璋', '赵韪', '益州', 104, 31),
(52, '孙权灭李术皖城之战', 200, '孙权', '李术', '皖城', 117, 31),
(53, '曹操破刘备徐州之战', 200, '曹操', '刘备', '徐州', 117, 34),
(54, '曹操斩颜良白马之战', 200, '曹操', '颜良', '白马', 115, 36),
(55, '蔡阳攻刘备汝南之战', 200, '蔡阳', '刘备', '汝南', 114, 33),
(56, '曹操夜袭乌巢之战', 200, '曹操', '袁绍', '乌巢', 116, 40),
(57, '曹操破袁绍仓亭之战', 201, '曹操', '袁绍', '仓亭', 102, 35),
(58, '钟繇击郭援平阳之战', 218, '钟繇', '郭援', '平阳', 112, 36),
(59, '袁谭与袁尚之战', 218, '袁谭', '袁尚', '中山', 117, 39),
(60, '曹操攻袁谭黎阳之战', 218, '曹操', '袁谭', '黎阳', 116, 27),
(61, '曹操攻袁尚邺城之战', 218, '曹操', '袁尚', '邺城', 115, 36),
(62, '曹操灭袁谭南皮之战', 218, '曹操', '袁谭', '南皮', 117, 38),
(63, '孙权平妫览戴员丹阳之战', 218, '孙权', '妫览', '丹阳', 120, 32),
(64, '杜畿灭卫固定河东之战', 218, '杜畿', '卫固', '河东', 110, 35),
(65, '曹操平定幽州之战', 218, '曹操', '焦触', '幽州', 117, 39),
(66, '曹操灭高斡壶关之战', 218, '曹操', '高斡', '壶关', 113, 37),
(67, '乐进李典破管承长广之战', 218, '乐进', '管承', '长广', 121, 37),
(68, '于禁平昌稀东海之战', 218, '于禁', '昌稀', '东海', 119, 35),
(69, '孙权攻黄祖江夏之战', 218, '孙权', '黄祖', '江夏', 114, 30),
(70, '曹操攻乌桓白狼山之战', 218, '曹操', '乌桓', '白狼山', 120, 41),
(71, '孙权灭黄祖夏口之战', 218, '孙权', '黄祖', '夏口', 114, 31),
(72, '曹操灭刘表襄阳之战', 218, '曹操', '刘表', '襄阳', 112, 32),
(73, '曹操破刘备当阳之战', 218, '曹操', '刘备', '当阳', 112, 31),
(74, '周瑜攻曹仁江陵之战', 218, '周瑜', '曹仁', '江陵', 112, 30),
(75, '刘封、孟达攻申耽上庸之战', 219, '刘封', '申耽', '上庸', 110, 32),
(76, '樊城之战', 219, '关羽', '于禁', '樊城', 112, 32),
(77, '吕蒙袭关羽江陵之战', 219, '吕蒙', '关羽', '江陵', 112, 30),
(78, '孟达攻刘封上庸之战', 220, '孟达', '刘封', '上庸', 110, 32),
(79, '苏则平定河西之乱', 220, '苏则', '羌人', '河西', 99, 40),
(80, '张既平定河西之战', 221, '张既', '苏衡', '河西', 99, 40),
(81, '夷陵之战', 221, '陆逊', '刘备', '夷陵', 111, 31),
(82, '杨洪平黄元叛蜀之战', 221, '杨洪', '黄元', '汉嘉', 103, 30),
(83, '曹休与吕范洞口之战', 221, '曹休', '吕范', '洞口', 118, 33),
(84, '曹仁与朱恒濡须口之战', 223, '曹仁', '朱恒', '濡须口', 118, 32),
(85, '张郃攻占江陵中洲之战', 223, '张郃', '吕范', '江陵', 112, 30),
(86, '曹真与朱然江陵之战', 223, '曹真', '朱然', '江陵', 112, 30),
(87, '贺齐取蘄春之战', 223, '贺齐', '晋宗', '蕲春', 115, 30),
(88, '田豫击鲜卑轲比能之战', 224, '田豫', '轲比能', '鲜卑', 115, 24),
(89, '曹丕攻广陵之战', 224, '曹丕', '徐盛', '广陵', 120, 32),
(90, '任福平蔡方、唐容之战', 225, '任福', '蔡方', '利成', 119, 35),
(91, '诸葛亮平南中之战', 225, '诸葛亮', '雍闿', '西昌', 115, 27),
(92, '周鲂攻彭绮鄱阳之战', 225, '周鲂', '彭绮', '鄱阳', 117, 29),
(93, '诸葛瑾攻襄阳之战', 226, '诸葛瑾', '司马懿', '襄阳', 112, 32),
(94, '张嶷平张慕之战', 227, '张嶷', '张慕', '绵竹', 104, 31),
(95, '曹真破赵云之战', 228, '曹真', '赵云', '箕谷', 107, 33),
(96, '孟达反魏之战', 228, '孟达', '司马懿', '上庸', 110, 32),
(97, '诸葛亮攻魏街亭之战', 228, '诸葛亮', '司马懿', '街亭', 106, 35),
(98, '诸葛亮攻魏陈仓之战', 229, '诸葛亮', '郝昭', '陈仓', 107, 34),
(99, '诸葛亮攻魏武都、阴平之战', 229, '诸葛亮', '郭淮', '武都', 105, 33),
(100, '魏与吴石亭之战', 229, '周鲂', '曹休', '石亭', 116, 41),
(101, '曹真攻蜀汉中之战', 230, '曹真', '诸葛亮', '汉中', 107, 33),
(102, '满宠守合肥之战', 230, '满宠', '孙权', '合肥', 117, 32),
(103, '诸葛亮攻魏上邦之战', 231, '诸葛亮', '司马懿', '上邦', 118, 25),
(104, '魏与吴成山之战', 232, '周贺', '田豫', '成山', 117, 34),
(105, '魏攻公孙渊辽东之战', 232, '司马懿', '公孙渊', '辽东', 104, 34),
(106, '魏击鲜卑楼烦之战', 233, '司马懿', '鲜卑', '楼烦', 112, 39),
(107, '吴攻魏合肥新城之战', 233, '孙权', '满宠', '合肥', 117, 32),
(108, '诸葛亮攻魏五丈原之战', 233, '诸葛亮', '司马懿', '五丈原', 108, 34),
(109, '杨仪杀魏延之战', 234, '杨仪', '魏延', '汉中', 107, 33),
(110, '吕岱平李桓、罗厉庐陵之战.', 234, '吕岱', '李桓', '庐陵', 115, 27),
(111, '陆逊平彭旦鄱阳之战', 237, '陆逊', '彭旦', '鄱阳', 117, 29),
(112, '司马懿平公孙渊辽东之战', 238, '司马懿', '公孙渊', '辽东', 104, 34),
(113, '吕岱平廖式交州之战', 239, '吕岱', '廖式', '交州', 111, 23),
(114, '吴攻魏芍陂、樊城之战', 241, '全琮', '孙礼', '樊城', 112, 32),
(115, '吴袭六安之战', 243, '诸葛恪', '王凌', '六安', 117, 32),
(116, '曹爽攻蜀汉中之战', 244, '曹爽', '蒋琬', '汉中', 107, 33),
(117, '毋丘俭攻高句丽之战', 246, '毋丘俭', '东川王', '高句丽', 126, 41),
(118, '姜维平汶山夷之战.', 247, '姜维', '夷族', '汶山', 104, 31),
(119, '姜维攻魏洮西之战', 247, '姜维', '郭淮', '洮西', 120, 32),
(120, '邓芝攻涪陵夷之战', 248, '邓芝', '夷族', '涪陵', 107, 30),
(121, '陆胤平交趾、九真夷之战', 248, '陆胤', '少数民族', '交趾', 114, 23),
(122, '姜维攻西平之战', 250, '姜维', '郭循', '西平', 114, 33),
(123, '吴败文钦之战', 250, '吕据', '文钦', '庐江', 117, 31),
(124, '魏与吴东兴之战', 252, '司马昭', '诸葛恪', '东兴', 105, 30),
(125, '吴、蜀攻魏南安、合肥之战', 253, '司马师', '姜维', '南安', 118, 25),
(126, '姜维攻临洮、陇西之战', 254, '姜维', '司马昭', '临洮', 104, 35),
(127, '司马师平毋丘俭、文钦之战', 255, '司马师', '毋丘俭', '寿春', 117, 33),
(128, '孙峻攻寿春之战', 255, '孙峻', '司马昭', '寿春', 117, 33),
(129, '姜维攻狄道之战', 255, '姜维', '王经', '狄道', 104, 35),
(130, '文钦、吕据攻魏之战', 256, '文钦', '邓艾', '乐嘉', 115, 34),
(131, '姜维攻段谷之战', 256, '姜维', '邓艾', '段谷', 106, 35),
(132, '姜维攻芒水之战', 257, '姜维', '邓艾', '芒水', 109, 34),
(133, '司马昭破诸葛诞寿春之战', 257, '司马昭', '诸葛诞', '寿春', 117, 33),
(134, '成济杀魏曹髦之战', 260, '成济', '曹髦', '洛阳', 112, 35),
(135, '姜维攻邓艾洮阳之战', 262, '姜维', '邓艾', '洮阳', 111, 26),
(136, '曹魏灭蜀之战', 263, '邓艾', '姜维', '成都', 104, 31),
(137, '吴平吕兴交趾之战', 263, '吴平', '吕兴', '交趾', 114, 23),
(138, '钟离牧平武陵之战', 263, '钟离牧', '郭纯', '武陵', 112, 29),
(139, '罗宪抗吴永安之战', 264, '罗宪', '司马昭', '永安', 120, 23),
(140, '王稚攻吴句章之战.', 264, '王稚', '吕据', '句章', 121, 30),
(141, '钟会、姜维反魏成都之战', 264, '姜维', '邓艾', '成都', 104, 31),
(142, '杨稷破刘俊交州之战', 268, '杨稷', '刘俊', '交州', 110, 26),
(143, '晋与吴合肥之战', 268, '丁奉', '司马骏', '合肥', 117, 32),
(144, '吴晋涡口之战', 270, '丁奉', '牵弘', '涡口', 117, 33),
(145, '青山之战', 271, '牵弘', '秃发树机能', '金城', 119, 32),
(146, '吴攻晋交趾等郡之战', 271, '丁奉', '牵弘', '交趾', 114, 23),
(147, '匈奴刘猛攻并州之战', 271, '刘猛', '刘钦', '并州', 113, 38),
(148, '晋攻匈奴刘猛之战', 272, '刘钦', '刘猛', '并州', 113, 38),
(149, '陆抗平西陵之战', 272, '陆抗', '步阐', '西陵', 111, 31),
(150, '吴镇压奚熙之乱', 274, '何植', '奚熙', '建业', 119, 32),
(151, '吴晋江夏之战', 277, '吴军', '晋军', '江夏', 114, 30),
(152, '晋与鲜卑武威之战', 278, '马隆', '鲜卑', '武威', 103, 38),
(153, '晋吴皖城之战', 278, '晋军', '吴军', '皖城', 117, 31),
(154, '马隆收复凉州之战', 279, '马隆', '秃发树机能', '凉州', 103, 38),
(155, '晋灭吴之战', 280, '司马炎', '孙皓', '建业', 119, 32);

-- --------------------------------------------------------

--
-- 表的结构 `zhanyi`
--

CREATE TABLE `zhanyi` (
  `id` char(10) NOT NULL,
  `place` char(10) NOT NULL,
  `x` char(10) NOT NULL,
  `y` char(10) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `zhanyi`
--

INSERT INTO `zhanyi` (`id`, `place`, `x`, `y`) VALUES
('1', '邺城', '114.41318', '36.280232'),
('2', '定陶', '115.079834', '35.078692'),
('3', '乘氏', '115.512835', '35.236628'),
('4', '巨野', '116.10189', '35.403946'),
('5', '昌邑', '116.133769', '35.1426'),
('6', '东缗', '116.325456', '35.076039'),
('7', '雍丘', '114.76468', '34.555146'),
('8', '武平', '115.45335', '33.865765'),
('9', '开封', '114.310283', '34.806679'),
('10', '郯县', '118.363249', '34.634016'),
('11', '黎阳', '114.564095', '35.688285'),
('12', '白马', '114.726415', '35.591514'),
('13', '延津', '114.004329', '35.450639'),
('14', '获嘉', '113.661977', '35.263923'),
('15', '原武', '113.892574', '35.103704'),
('16', '阳武', '114.166526', '35.146034'),
('17', '官渡', '114.031366', '34.997964'),
('18', '乌巢', '114.362359', '35.239487'),
('19', '故市', '113.534587', '34.88672'),
('20', '许昌', '113.859909', '34.041912'),
('21', '鸡洛山', '113.066261', '34.500601'),
('22', '白帝', '109.581763', '31.047198'),
('23', '秭归', '110.884164', '30.931931'),
('24', '夷道', '111.429482', '30.435788'),
('25', '猇亭', '111.43841', '30.549406'),
('26', '涿乡', '111.2204', '30.718311'),
('27', '马鞍山', '111.115191', '30.79726'),
('28', '新野', '112.37086', '32.528579'),
('29', '襄阳', '112.138019', '32.011858'),
('30', '长坂', '111.794075', '30.827823'),
('31', '江陵', '112.434612', '30.049044'),
('32', '华容', '113.150796', '29.304715'),
('33', '乌林', '113.607958', '29.920287'),
('34', '赤壁', '113.902129', '29.734681'),
('35', '夏口', '114.205585', '30.568572'),
('36', '樊口', '114.454994', '30.489557'),
('37', '柴桑', '115.914819', '29.615307'),
('38', '鄄城', '115.484327', '35.641924'),
('39', '东阿', '116.25622', '36.343516'),
('40', '山阳', '116.154513', '35.292541'),
('41', '成都', '104.080794', '30.653336'),
('42', '宜宾', '104.651703', '28.758767'),
('43', '安上', '104.358424', '28.834528'),
('44', '卑水', '103.57555', '28.267678'),
('45', '昭觉', '102.848273', '28.021271'),
('46', '邛都', '102.279529', '27.889088'),
('47', '大姚', '101.330568', '25.728903'),
('48', '大理', '100.304048', '25.684875'),
('49', '楚雄', '101.528088', '25.060938'),
('50', '昆明', '102.842318', '24.888108'),
('51', '东川', '103.196178', '26.092948'),
('52', '昭通', '103.721785', '27.343313'),
('53', '汉阳', '104.530973', '28.442204'),
('54', '函谷关', '110.930867', '34.630524'),
('55', '潼关', '110.26631', '34.553418'),
('56', '蒲坂', '110.43733', '34.861694'),
('57', '河西', '110.106079', '34.861694'),
('58', '华阴', '110.106079', '34.571563'),
('59', '长安', '108.94819', '34.346077'),
('60', '褒中', '106.972166', '33.124149'),
('61', '箕谷', '107.103534', '33.279789'),
('62', '祁山', '105.185889', '34.253667'),
('63', '街亭', '105.994093', '35.001255'),
('64', '陈仓', '107.373712', '34.357498');

--
-- 转储表的索引
--

--
-- 表的索引 `sheet2`
--
ALTER TABLE `sheet2`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `sheet2`
--
ALTER TABLE `sheet2`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=156;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
